print('Задумайте число від 0 до 1000000')
min = 0
max = 1000000
print('Якщо ваше число більше введіть "б", якщо ваше число менше - введіть "м". Якщо рівне - введіть "р"')
res =''
n = 0
while res != 'р':
    res = input(f'Ваше число {(min + max) // 2}: ')
    if res == 'б':
        min = (max + min) // 2
        n += 1
    elif res == 'м':
        max = (max + min) // 2
        n += 1
    elif res == 'р':
        print(f'Вітаю!!! ваше число відгадано за {n} спроб')
    else:
        print('Якщо ваше число більше введіть "б", якщо ваше число менше - введіть "м". Якщо рівне - введіть "р"'
              )